#! /usr/local/bin/python3

'''Создайте скрипт который запрашивает у пользователя 2 значения для переменных, а затем меняет эти значения для переменных, например

«Введите переменную а: »  24
«Введите переменную b: »  48
Вывод:
«Введите переменную а: »  48
«Введите переменную b: »  24
'''


while 1:
	a = input('Введите переменную а: ')
	b = input('Введите переменную b: ')
	print("Введите переменную а: ", b)
	print("Введите переменную b: ", a)


